#+TITLE: Tema 7: Ficheros
#+DATE:
#+STARTUP: beamer
#+SETUPFILE: config.org
#+OPTIONS: H:2


** Ejemplo de =fscanf=
   :PROPERTIES:
   :beamer_opt: plain
   :END:

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int i, n, vals[3];
  FILE *pf;
  // Abrimos fichero para lectura
  pf = fopen("datos.txt", "r");
  // Leemos datos separados por comas
  n = fscanf(pf, "%i, %i, %i",
	 &vals[0], &vals[1], &vals[2]);
  printf("Se han leído %i argumentos.\n", n);
  fclose(pf);
  // Mostramos en pantalla lo leído
  for (i = 0; i < 3; i++)
    printf("%i\t", vals[i]);

  return(0);
}
#+END_SRC

#+RESULTS:
| Se | han | leído | 3 | argumentos. |
|  1 |   2 |     3 |   |             |



** COMMENT Ejemplo de =fgetc=
   :PROPERTIES:
   :beamer_opt: plain
   :END:
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int i;
  char texto[27];
  FILE *pf;
  // Abrimos fichero para lectura
  pf = fopen("lorem_ipsum.txt", "r");
  // Leemos los 26 primeros caracteres
  for (i = 0; i < 26; i++)
    texto[i] = fgetc(pf);
  // Añadimos caracter nulo
  texto[26] = '\0';
  // Mostramos resultado
  printf("%s", texto);
  fclose(pf);
  return(0);
}
#+END_SRC

#+RESULTS:
: Lorem ipsum dolor sit amet

** Ejemplo: número de líneas de un fichero

#+begin_src C
#include <stdio.h>

int main()
{
  int i, nLineas = 0;
  char x; // Variable auxiliar
  FILE *pf;
  pf = fopen("lorem_ipsum.txt", "r");
  // Leemos caracter a caracter
  while (fscanf(pf, "%c", &x) != EOF)
    //Si lo leído es un salto de línea
      if (x == '\n')
	//incrementamos el contador
	++nLineas;
  printf("%i", nLineas);
  return 0;
}
#+end_src

#+RESULTS:
: 16

** COMMENT Número de líneas de un fichero
Para detectar (y avanzar) el salto de línea empleamos =%[^\n]\n=
#+begin_src C
#include <stdio.h>

int main()
{
  int i, nLineas = 0;
  char linea[100];
  FILE *pf;
  pf = fopen("lorem_ipsum.txt", "r");
  while (fscanf(pf, "%[^\n]\n", linea) != EOF)
      ++nLineas;
  printf("%i", nLineas); 
  return 0;
}
#+end_src

#+RESULTS:
: 15

*** Ejemplo
 #+BEGIN_SRC C
#include <stdio.h>

int main(){
  printf("hello there.\n");
  fprintf(stdout, "hello there.\n");
  return 0;
}
 #+END_SRC

 #+RESULTS:
 | hello | there. |
 | hello | there. |


** Ejemplo: nº de bytes de un fichero

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  long int fsize; // tamaño del fichero
  FILE *pf;
  pf = fopen("datos.txt", "r");
  // Desplaza al final
  fseek(pf, 0, SEEK_END);
  //Almacena la posición
  fsize = ftell(pf);
  printf("El fichero tiene %li bytes.\n",
	 fsize);
  return 0;
}
#+END_SRC

#+RESULTS:
: El fichero tiene 7 bytes.

